pascal-3.2/tutorials/surfaceTracking/newInterTrackFoam/capillarity2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass    newInterTrackFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             10;

deltaT              0.01;

writeControl        runTime;

writeInterval       0.05;

cycleWrite          0;

writeFormat         binary;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

//functions
//(
//   history
//   {
//       type sloshingHistory;
//       functionObjectLibs
//       (
//         "libsloshingHistory.so"
//       );
//   }
//);

// ************************************************************************* //

